# 과제1. car seat 매출 분석

* 카시트에 대해서 지역 매장 별 매출액을 살펴보고자 합니다.
* 행은 자사 매장이 있는 각 지역별 데이터 입니다.

![](https://cdn.images.express.co.uk/img/dynamic/24/590x/child-car-seat-986556.jpg?r=1532946857754)

## 0.환경설정

* 필요한 라이브러리 로딩, 데이터셋 가져오기

### 1) 라이브러리 로딩

In [3]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns

### 2) 데이터 불러오기

In [2]:
path = 'https://raw.githubusercontent.com/JunhoYu/Data-Analysis/main/Carseats.csv'
data = pd.read_csv(path)
data.head()

,Sales,CompPrice,Income,Advertising,Population,Price,ShelveLoc,Age,Education,Urban,US
0,9.50,138,73,11,276,120,Bad,42,17,Yes,Yes
1,11.22,111,48,16,260,83,Good,65,10,Yes,Yes
2,10.06,113,35,10,269,80,Medium,59,12,Yes,Yes
3,7.40,117,100,4,466,97,Medium,55,14,Yes,Yes
4,4.15,141,64,3,340,128,Bad,38,13,Yes,No

|	변수명	|	설명	|	구분	|
|	----	|	----	|	----	|
|	Sales 	|	 각 지역 판매량(단위 : 1000개)	|	Target	|
|	CompPrice 	|	 각 지역 경쟁사 가격(단위 : 달러)	|	feature	|
|	Income 	|	 각 지역 소득수준(단위 : 천달러)	|	feature	|
|	Advertising 	|	 각 지역, 회사의 광고 예산(단위 : 1000달러)	|	feature	|
|	Population 	|	 지역 인구수(단위 : 1000명)	|	feature	|
|	Price 	|	 자사 지역별 판매가격(달러)	|	feature	|
|	Education 	|	 교육수준(10~18), 범주	|	feature	|
|	ShelveLoc 	|	 진열상태(Good, Medium, Bad)	|	feature	|
|	Age 	|	 지역 인구의 평균 연령	|	feature	|
|	US 	|	 매장이 미국에 있는지 여부(Yes, No)	|	feature	|
|	Urban 	|	 매장이 도심에 있는지 여부(Yes, No)	|	feature	|

## 1.데이터 살펴보기

* 주어진 데이터로부터 다양한 조회 방법을 통해 비즈니스 사항을 파악해 봅시다.
* 데이터와 비즈니스를 파악하기 위한 질문을 10개 이상 도출하고, 조회해 봅시다.

In [ ]:
지역별 판매량이 10000개 이상인 곳이 어딘지?

In [4]:
path='https://bit.ly/3HaMAtZ'
data = pd.read_csv(path)

In [9]:
data.groupby(['Embarked', 'Pclass'])['Age'].median()

Embarked  Pclass
C         1         35.90
          2         27.00
          3         27.75
Q         1         38.50
          2         30.00
          3         27.00
S         1         35.90
          2         30.00
          3         26.00
Name: Age, dtype: float64

In [ ]:
객실등급(Pclass) 2등급, 성별(Sex) 남자인 승객의 평균 나이(Age)를 구하시오. (소수점 3자리까지)
링크 : https://bit.ly/3HaMAtZ

In [26]:
data.groupby(['Pclass','Sex'], as_index=False)[['Age']].mean()

   Pclass     Sex        Age
0       1  female  34.584787
1       1    male  39.826393
2       2  female  28.540000
3       2    male  30.876481
4       3  female  22.638958
5       3    male  27.775216

In [23]:
path='https://bit.ly/3HaMAtZ'
data= pd.read_csv(path)

In [22]:
data.loc[(data['Pclass']=='2')& (data['Sex']=='male')].mean()

Survived      NaN
Pclass        NaN
Sex           NaN
Age           NaN
SibSp         NaN
Parch         NaN
Fare          NaN
Embarked      NaN
AgeGroup      NaN
Family        NaN
Age_scale1    NaN
dtype: object

In [ ]:
data[['MonthlyIncome', 'TotalWorkingYears']].mean()
data.loc[(data['DistanceFromHome'] > 10) & (data['JobSatisfaction'] == 4)]
data_mean = data.groupby('MaritalStatus', as_index=False)[['Age','MonthlyIncome']].mean()